Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/External/Incoming/v2/BusinessServices/ConsultaFinancierasACH_v2/wsdl/ConsultaFinancierasACH_v2.wsdl

<WL5G3N0:definitions name="consultaFinancierasACHPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" xmlns:WL5G3N2="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:WL5G3N3="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:WL5G3N4="http://schemas.xmlsoap.org/wsdl/soap/">
  <WL5G3N0:types>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
    </xsd:schema>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" schemaLocation="../xsd/ConsultaFinancierasACHTypes.xsd"/>
    </xsd:schema>
  </WL5G3N0:types>
  <WL5G3N0:message name="consultaFinancierasACHRequest">
    <WL5G3N0:part element="WL5G3N1:consultaFinancierasACH" name="parameters"/>
    <WL5G3N0:part element="WL5G3N2:RequestHeader" name="RequestHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="consultaFinancierasACHResponse">
    <WL5G3N0:part element="WL5G3N1:consultaFinancierasACHResponse" name="result"/>
    <WL5G3N0:part element="WL5G3N2:ResponseHeader" name="ResponseHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:portType name="consultaFinancierasACHPS">
    <WL5G3N0:operation name="consultaFinancierasACH" parameterOrder="parameters RequestHeader ResponseHeader">
      <WL5G3N0:input message="WL5G3N3:consultaFinancierasACHRequest"/>
      <WL5G3N0:output message="WL5G3N3:consultaFinancierasACHResponse"/>
    </WL5G3N0:operation>
  </WL5G3N0:portType>
  <WL5G3N0:binding name="consultaFinancierasACHPSSOAP" type="WL5G3N3:consultaFinancierasACHPS">
    <WL5G3N4:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <WL5G3N0:operation name="consultaFinancierasACH">
      <WL5G3N4:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/consultaFinancierasACH"/>
      <WL5G3N0:input>
        <WL5G3N4:body parts="parameters" use="literal"/>
        <WL5G3N4:header message="WL5G3N3:consultaFinancierasACHRequest" part="RequestHeader" use="literal"/>
      </WL5G3N0:input>
      <WL5G3N0:output>
        <WL5G3N4:body parts="result" use="literal"/>
        <WL5G3N4:header message="WL5G3N3:consultaFinancierasACHResponse" part="ResponseHeader" use="literal"/>
      </WL5G3N0:output>
    </WL5G3N0:operation>
  </WL5G3N0:binding>
  <WL5G3N0:service name="consultaFinancierasACHPS">
    <WL5G3N0:port binding="WL5G3N3:consultaFinancierasACHPSSOAP" name="consultaFinancierasACHPSSOAP">
      <WL5G3N4:address location="https://10.9.104.250:8004/SMiddleware/ReferenceData/CommonBusinessInformation/ConsultaFinancierasACH_v2"/>
    </WL5G3N0:port>
  </WL5G3N0:service>
</WL5G3N0:definitions>